app/views/users/edit.html.erb


         <div><%= f.collection_select :game_ids, Game.all, :id, :title %></div>
---
SELECT "games".* FROM "games"