app/views/users/show.html.erb


<% @user.games.each do |game| %>
---
SELECT "games".* FROM "games" INNER JOIN "libraries" ON "games"."id" = "libraries"."game_id" WHERE "libraries"."user_id" = ?  [["user_id", 3]]