app/views/users/show.html.erb


<% @user.libraries.each do |lib| %>
---
SELECT "libraries".* FROM "libraries" WHERE "libraries"."user_id" = ?  [["user_id", 2]]