app/views/users/show.html.erb

SELECT "libraries".* FROM "libraries" WHERE "libraries"."user_id" = ?  [["user_id", 2]]
---

    <% @user.libraries.each do |lib| %>