app/views/games/show.html.erb


<p><%= @game.users.count %> user(s) have added this game.</p>
---
SELECT "users"."id" FROM "users" INNER JOIN "libraries" ON "users"."id" = "libraries"."user_id" WHERE "libraries"."game_id" = ?  [["game_id", 2]]
SELECT COUNT(*) FROM "users" INNER JOIN "libraries" ON "users"."id" = "libraries"."user_id" WHERE "libraries"."game_id" = ?  [["game_id", 2]]

<% end %>
<% if @current && !@game.users.include?(@current) %>
---
SELECT "users"."id" FROM "users" INNER JOIN "libraries" ON "users"."id" = "libraries"."user_id" WHERE "libraries"."game_id" = ?  [["game_id", 2]]
SELECT 1 AS one FROM "users" INNER JOIN "libraries" ON "users"."id" = "libraries"."user_id" WHERE "libraries"."game_id" = ? AND "users"."id" = ? LIMIT ?  [["game_id", 3], ["id", 4], ["LIMIT", 1]]