app/controllers/games_controller.rb

INSERT INTO "games" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "The worst game ever"], ["created_at", "2020-04-07 20:19:36.614848"], ["updated_at", "2020-04-07 20:19:36.614848"]]
---
    def create
        @game = Game.create(game_params)

UPDATE "games" SET "img" = ?, "updated_at" = ? WHERE "games"."id" = ?
---
    def update
        game = find_game
        game.update(game_params)

DELETE FROM "games" WHERE "games"."id" = ?  [["id", 7]]
---
    def destroy
        game = find_game
        game.destroy

INSERT INTO "libraries" ("user_id", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["game_id", 1], ["created_at", "2020-04-09 03:56:46.794808"], ["updated_at", "2020-04-09 03:56:46.794808"]]
---
    def buy
        # byebug
        game = find_game
        user = session[:user_id]
        Library.create(game: game, user_id: user)

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_game
        @game = Game.find(params[:id])