app/controllers/libraries_controller.rb

    def show
        @library = Library.find(params[:id])
---
SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
        library = Library.find(params[:id])
        user = library.user
        library.destroy
---
SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
DELETE FROM "libraries" WHERE "libraries"."id" = ?  [["id", 27]]