app/controllers/sessions_controller.rb

    def create
        @user = User.find_by(email: login_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "alexduterte@gmail.com"], ["LIMIT", 1]]