app/controllers/users_controller.rb

    def index
         @@user
        @users = User.all
---
SELECT "users".* FROM "users"

    def loggedin

        @@user = User.find_by(name: params[:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Alex"], ["LIMIT", 1]]

    def create
        @user = User.create(user_params)
        if @user.valid?
            @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "email", "password_digest") VALUES (?, ?, ?, ?, ?)
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Alex D"], ["updated_at", "2020-04-07 19:54:33.746493"], ["id", 2]]

    def update
        user = find_user
        game = Game.find(params[:user][:game_ids])
        # byebug
        user.games << game
        user.save
        user.update(name: params[:name])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "email" = ? WHERE "users"."id" = ?  [["updated_at", "2020-04-09 16:34:51.318903"], ["email", "noob2@noob.com"], ["id", 4]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "NFamous Wun"], ["updated_at", "2020-04-09 01:26:57.952543"], ["id", 2]]

    def destroy
        user = find_user
        user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]