app/controllers/users_controller.rb

    def add_friend
        @user = User.find(params[:id])
        Friend.create(myself: @current, friend: @user)
        Friend.create(myself: @user, friend: @current)
---
INSERT INTO "friends" ("myself_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["myself_id", 4], ["friend_id", 2], ["created_at", "2020-04-13 03:02:43.081835"], ["updated_at", "2020-04-13 03:02:43.081835"]]
INSERT INTO "friends" ("myself_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["myself_id", 2], ["friend_id", 3], ["created_at", "2020-04-13 03:12:06.885267"], ["updated_at", "2020-04-13 03:12:06.885267"]]