app/controllers/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
    def destroy
        user = find_user
        user.destroy